from rubpy import Client, handlers, Message
import asyncio
import random
import khayyam
from rubpy import models
import requests
import datetime
import pyjokes as joke
from phonenumbers import carrier
from phonenumbers import geocoder
from phonenumbers import parse
from phonenumbers import is_valid_number
import phonenumbers 
import emoji
import socket 
import pyautogui
import webbrowser
import os

list_command =[]
from asyncio import create_task, run
from deep_translator import GoogleTranslator
t=khayyam.JalaliDatetime.today().strftime("%A %D %B %Y")
list_salam =["hello","你好","Bonjour","Hallo","Привет","नमस्ते"]
list_salam.append("علیک سلام عزیزم")
list_eimoji=["😭","😂","😀","😉","🙂","🙃","🥰","🤣","😆","😁","🤫","😅","🤢","🥹","😈","😤","😧","😫","🤡","🐒","🦁","🤵","🐍","🫅","🧑‍🤝‍🧑"]



nmber_list =["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","27","28","29","30"]


Stikers = ["❌ ✅ ❌ ✅ ❌ ✅ ❌ ✅","✅ ❌ ✅ ❌ ✅ ❌ ✅ ❌","🔴 🔵 🔴 🔵 🔴 🔵 🔴 🔵","🟢 🟡 🟢 🟡 🟢 🟡 🟢 🟡","🌸 🍀 🌸 🍀 🌸 🍀 🌸 🍀","🌞 🌛 🌞 🌛 🌞 🌛 🌞 🌛"] * 2   
Stikers.append("❌اخطار گرفتی دلقک تکرار نکن❌")           
Dans = ["""
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟪🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟪🟪🟪🟧🟧🟧
🟧🟧🟧🟪🟧🟪🟧🟧🟧
🟧🟧🟧🟪🟪🟪🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟪🟪🟪🟪🟪🟧🟧
🟧🟧🟪🟧🟧🟧🟪🟧🟧
🟧🟧🟪🟧🟦🟧🟪🟧🟧
🟧🟧🟪🟧🟧🟧🟪🟧🟧
🟧🟧🟪🟪🟪🟪🟪🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟪🟪🟪🟪🟪🟪🟪🟧
🟧🟪🟧🟧🟧🟧🟧🟪🟧
🟧🟪🟧🟦🟦🟦🟧🟪🟧
🟧🟪🟧🟦🟧🟦🟧🟪🟧
🟧🟪🟧🟦🟦🟦🟧🟪🟧
🟧🟪🟧🟧🟧🟧🟧🟪🟧
🟧🟪🟪🟪🟪🟪🟪🟪🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
""",
        """
🟪🟪🟪🟪🟪🟪🟪🟪🟪
🟪🟧🟧🟧🟧🟧🟧🟧🟪
🟪🟧🟦🟦🟦🟦🟦🟧🟪
🟪🟧🟦🟧🟧🟧🟦🟧🟪
🟪🟧🟦🟧⬜️🟧🟦🟧🟪
🟪🟧🟦🟧🟧🟧🟦🟧🟪
🟪🟧🟦🟦🟦🟦🟦🟧🟪
🟪🟧🟧🟧🟧🟧🟧🟧🟪
🟪🟪🟪🟪🟪🟪🟪🟪🟪
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧🟦🟦🟦🟦🟦🟦🟦🟧
🟧🟦🟧🟧🟧🟧🟧🟦🟧
🟧🟦🟧⬜️⬜️⬜️🟧🟦🟧
🟧🟦🟧⬜️⬜️⬜️🟧🟦🟧
🟧🟦🟧⬜️⬜️⬜️🟧🟦🟧
🟧🟦🟧🟧🟧🟧🟧🟦🟧
🟧🟦🟦🟦🟦🟦🟦🟦🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
""",
        """
🟦🟦🟦🟦🟦🟦🟦🟦🟦
🟦🟧🟧🟧🟧🟧🟧🟧🟦
🟦🟧⬜️⬜️⬜️⬜️⬜️🟧🟦
🟦🟧⬜️⬜️⬜️⬜️⬜️🟧🟦
🟦🟧⬜️⬜️⬜️⬜️⬜️🟧🟦
🟦🟧⬜️⬜️⬜️⬜️⬜️🟧🟦
🟦🟧⬜️⬜️⬜️⬜️⬜️🟧🟦
🟦🟧🟧🟧🟧🟧🟧🟧🟦
🟦🟦🟦🟦🟦🟦🟦🟦🟦
""",
        """
🟧🟧🟧🟧🟧🟧🟧🟧🟧
🟧⬜️⬜️⬜️⬜️⬜️⬜️⬜️🟧
🟧⬜️⬜️⬜️⬜️⬜️⬜️⬜️🟧
🟧⬜️⬜️⬜️⬜️⬜️⬜️⬜️🟧
🟧⬜️⬜️⬜️⬜️⬜️⬜️⬜️🟧
🟧⬜️⬜️⬜️⬜️⬜️⬜️⬜️🟧
🟧⬜️⬜️⬜️⬜️⬜️⬜️⬜️🟧
🟧⬜️⬜️⬜️⬜️⬜️⬜️⬜️🟧
🟧🟧🟧🟧🟧🟧🟧🟧🟧
""",
        """
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥⬜⬜⬜⬜⬜⬜⬜⬜️🟥
🟥⬜⬜⬜⬜⬜⬜⬜⬜🟥
🟥⬜⬜⬜⬜⬜⬜⬜⬜🟥
🟥⬜⬜⬜⬜⬜⬜⬜⬜🟥
🟥⬜⬜⬜⬜⬜⬜⬜⬜🟥
🟥⬜⬜⬜⬜⬜⬜⬜⬜🟥
🟥⬜⬜⬜⬜⬜⬜⬜⬜🟥
🟥⬜⬜⬜⬜⬜⬜⬜⬜🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥⬜⬜⬜⬜⬜⬜🟥🟥
🟥🟥⬜⬜⬜⬜⬜⬜🟥🟥
🟥🟥⬜⬜⬜⬜⬜⬜🟥🟥
🟥🟥⬜⬜⬜⬜⬜⬜🟥🟥
🟥🟥⬜⬜⬜⬜⬜⬜🟥🟥
🟥🟥⬜⬜⬜⬜⬜⬜🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥⬜⬜⬜⬜️🟥🟥🟥
🟥🟥🟥⬜⬜⬜⬜🟥🟥🟥
🟥🟥🟥⬜⬜⬜⬜🟥🟥🟥
🟥🟥🟥⬜⬜⬜⬜🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥⬜️⬜️🟥🟥🟥🟥
🟥🟥🟥🟥⬜⬜️🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥💙💙🟥🟥🟥🟥
🟥🟥🟥🟥💙💙🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟦🟦🟥🟥🟥🟥
🟥🟥🟥🟥🟦🟦🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟦🟦🟦🟦🟥🟥🟥
🟥🟥🟥🟦🟦🟦🟦🟥🟥🟥
🟥🟥🟥🟦🟦🟦🟦🟥🟥🟥
🟥🟥🟥🟦🟦🟦🟦🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟨🟨🟨🟨🟨🟨🟥🟥
🟥🟥🟨🟦🟦🟦🟦🟨🟥🟥
🟥🟥🟨🟦🟦🟦🟦🟨🟥🟥
🟥🟥🟨🟦🟦🟦🟦🟨🟥🟥
🟥🟥🟨🟦🟦🟦🟦🟨🟥🟥
🟥🟥🟨🟨🟨🟨🟨🟨🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟨🟨🟨🟨🟨🟨🟨🟨🟥
🟥🟨🟨🟨🟨🟨🟨🟨🟨🟥
🟥🟨🟨🟦🟦🟦🟦🟨🟨🟥
🟥🟨🟨🟦🟦🟦🟦🟨🟨🟥
🟥🟨🟨🟦🟦🟦🟦🟨🟨🟥
🟥🟨🟨🟦🟦🟦🟦🟨🟨🟥
🟥🟨🟨🟨🟨🟨🟨🟨🟨🟥
🟥🟨🟨🟨🟨🟨🟨🟨🟨🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟪🟨🟨🟨🟨🟨🟨🟪🟥
🟥🟨🟪🟨🟨🟨🟨🟪🟨🟥
🟥🟨🟨🟦🟦🟦🟦🟨🟨🟥
🟥🟨🟨🟦🟦🟦🟦🟨🟨🟥
🟥🟨🟨🟦🟦🟦🟦🟨🟨🟥
🟥🟨🟨🟦🟦🟦🟦🟨🟨🟥
🟥🟨🟪🟨🟨🟨🟨🟪🟨🟥
🟥🟪🟨🟨🟨🟨🟨🟨🟪🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟪🟨🟨🟨🟨🟨🟨🟪🟥
🟥🟪🟪🟨🟨🟨🟨🟪🟪🟥
🟥🟪🟨🟦🟦🟦🟦🟨🟪🟥
🟥🟪🟨🟦🟦🟦🟦🟨🟪🟥
🟥🟪🟨🟦🟦🟦🟦🟨🟪🟥
🟥🟪🟨🟦🟦🟦🟦🟨🟪🟥
🟥🟪🟪🟨🟨🟨🟨🟪🟪🟥
🟥🟪🟨🟨🟨🟨🟨🟨🟪🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟪🟪🟨🟨🟨🟨🟪🟪🟥
🟥🟪🟨🟦🟦🟦🟦🟨🟪🟥
🟥🟪🟨🟦🟦🟦🟦🟨🟪🟥
🟥🟪🟨🟦🟦🟦🟦🟨🟪🟥
🟥🟪🟨🟦🟦🟦🟦🟨🟪🟥
🟥🟪🟪🟨🟨🟨🟨🟪🟪🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟪🟪⬛️⬛️⬛️⬛️🟪🟪🟥
🟥🟪🟧🟦🟦🟦🟦🟧🟪🟥
🟥🟪🟧🟦🟦🟦🟦🟧🟪🟥
🟥🟪🟧🟦🟦🟦🟦🟧🟪🟥
🟥🟪🟧🟦🟦🟦🟦🟧🟪🟥
🟥🟪🟪⬛️⬛️⬛️⬛️🟪🟪🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟪🟪⬛️⬛️⬛️⬛️🟪🟪🟥
🟥🟪🟧🟨🟦🟦🟨🟧🟪🟥
🟥🟪🟧🟦🟨🟨🟦🟧🟪🟥
🟥🟪🟧🟦🟨🟨🟦🟧🟪🟥
🟥🟪🟧🟨🟦🟦🟨🟧🟪🟥
🟥🟪🟪⬛️⬛️⬛️⬛️🟪🟪🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟪🟪⬛️⬛️⬛️⬛️🟪🟪🟥
🟥🟪🟧💛🟦🟦💛🟧🟪🟥
🟥🟪🟧🟦💛💛🟦🟧🟪🟥
🟥🟪🟧🟦💛💛🟦🟧🟪🟥
🟥🟪🟧💛🟦🟦💛🟧🟪🟥
🟥🟪🟪⬛️⬛️⬛️⬛️🟪🟪🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟪🟪⬛️⬛️⬛️⬛️🟪🟪🟥
🟥🟪🟧💛💙💙💛🟧🟪🟥
🟥🟪🟧💙💛💛💙🟧🟪🟥
🟥🟪🟧💙💛💛💙🟧🟪🟥
🟥🟪🟧💛💙💙💛🟧🟪🟥
🟥🟪🟪⬛️⬛️⬛️⬛️🟪🟪🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟪🟪🖤🖤🖤🖤🟪🟪🟥
🟥🟪🟧💛💙💙💛🟧🟪🟥
🟥🟪🟧💙💛💛💙🟧🟪🟥
🟥🟪🟧💙💛💛💙🟧🟪🟥
🟥🟪🟧💛💙💙💛🟧🟪🟥
🟥🟪🟪🖤🖤🖤🖤🟪🟪🟥
🟥🟪🟩🟩🟩🟩🟩🟩🟪🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥💜🟩🟩🟩🟩🟩🟩💜🟥
🟥💜💜🖤🖤🖤🖤💜💜🟥
🟥💜🟧💛💙💙💛🟧💜🟥
🟥💜🟧💙💛💛💙🟧💜🟥
🟥💜🟧💙💛💛💙🟧💜🟥
🟥💜🟧💛💙💙💛🟧💜🟥
🟥💜💜🖤🖤🖤🖤💜💜🟥
🟥💜🟩🟩🟩🟩🟩🟩💜🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥💜🟩🟩🟩🟩🟩🟩💜🟥
🟥💜💜🖤🖤🖤🖤💜💜🟥
🟥💜🧡💛💙💙💛🧡💜🟥
🟥💜🧡💙💛💛💙🧡💜🟥
🟥💜🧡💙💛💛💙🧡💜🟥
🟥💜🧡💛💙💙💛🧡💜🟥
🟥💜💜🖤🖤🖤🖤💜💜🟥
🟥💜🟩🟩🟩🟩🟩🟩💜🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
🟥💜💚💚💚💚💚💚💜🟥
🟥💜💜🖤🖤🖤🖤💜💜🟥
🟥💜🧡💛💙💙💛🧡💜🟥
🟥💜🧡💙💛💛💙🧡💜🟥
🟥💜🧡💙💛💛💙🧡💜🟥
🟥💜🧡💛💙💙💛🧡💜🟥
🟥💜💜🖤🖤🖤🖤💜💜🟥
🟥💜💚💚💚💚💚💚💜🟥
🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥
""",
        """
❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️
❤️💜💚💚💚💚💚💚💜❤️
❤️💜💜🖤🖤🖤🖤💜💜❤️
❤️💜🧡💛💙💙💛🧡💜❤️
❤️💜🧡💙💛💛💙🧡💜❤️
❤️💜🧡💙💛💛💙🧡💜❤️
❤️💜🧡💛💙💙💛🧡💜❤️
❤️💜💜🖤🖤🖤🖤💜💜❤️
❤️💜💚💚💚💚💚💚💜❤️
❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️
""",
        """
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜
""",
        """
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️◻️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜
""",
        """
⬜️⬜️⬜️⬜️⬜️⬜️⬜️◻️◽️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️◻️◻️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜
""",
        """
⬜️⬜️⬜️⬜️⬜️⬜️◻️◽️▫️
⬜️⬜️⬜️⬜️⬜️⬜️◻️◽️◽️
⬜️⬜️⬜️⬜️⬜️⬜️◻️◻️◻️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜
""",
        """
⬜️⬜️⬜️⬜️⬜️◻️◽️▫️▫️
⬜️⬜️⬜️⬜️⬜️◻️◽️▫️▫️
⬜️⬜️⬜️⬜️⬜️◻️◽️◽️◽️
⬜️⬜️⬜️⬜️⬜️◻️◻️◻️◻️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜
""",
        """
⬜️⬜️⬜️⬜️◻️◽️▫️▫️▫️
⬜️⬜️⬜️⬜️◻️◽️▫️▫️▫️
⬜️⬜️⬜️⬜️◻️◽️▫️▫️▫️
⬜️⬜️⬜️⬜️◻️◽️◽️◽️◽️
⬜️⬜️⬜️⬜️◻️◻️◻️◻️◻️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜
""",
        """
⬜️⬜️⬜️◻️◽️▫️▫️▫️▫️
⬜️⬜️⬜️◻️◽️▫️▫️▫️▫️
⬜️⬜️⬜️◻️◽️▫️▫️▫️▫️
⬜️⬜️⬜️◻️◽️▫️▫️▫️▫️
⬜️⬜️⬜️◻️◽️◽️◽️◽️◽️
⬜️⬜️⬜️◻️◻️◻️◻️◻️◻️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜
""",
        """
⬜️⬜️◻️◽️▫️▫️▫️▫️▫️
⬜️⬜️◻️◽️▫️▫️▫️▫️▫️
⬜️⬜️◻️◽️▫️▫️▫️▫️▫️
⬜️⬜️◻️◽️▫️▫️▫️▫️▫️
⬜️⬜️◻️◽️▫️▫️▫️▫️▫️
⬜️⬜️◻️◽️◽️◽️◽️◽️◽️
⬜️⬜️◻️◻️◻️◻️◻️◻️◻️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜
""",
        """
⬜️◻️◽️▫️▫️▫️▫️▫️▫️
⬜️◻️◽️▫️▫️▫️▫️▫️▫️
⬜️◻️◽️▫️▫️▫️▫️▫️▫️
⬜️◻️◽️▫️▫️▫️▫️▫️▫️
⬜️◻️◽️▫️▫️▫️▫️▫️▫️
⬜️◻️◽️▫️▫️▫️▫️▫️▫️
⬜️◻️◽️◽️◽️◽️◽️◽️◽️
⬜️◻️◻️◻️◻️◻️◻️◻️◽️
⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜
""",
        """
◻️◽️▫️▫️▫️▫️▫️▫️▫️
◻️◽️▫️▫️▫️▫️▫️▫️▫️
◻️◽️▫️▫️▫️▫️▫️▫️▫️
◻️◽️▫️▫️▫️▫️▫️▫️▫️
◻️◽️▫️▫️▫️▫️▫️▫️▫️
◻️◽️▫️▫️▫️▫️▫️▫️▫️
◻️◽️▫️▫️▫️▫️▫️▫️▫️
◻️◽️◽️◽️◽️◽️◽️◽️◽️
◻️◻️◻️◻️◻️◻️◻️◻️◻️
""",
        """
◽️▫️▫️▫️▫️▫️▫️▫️▫️
◽️▫️▫️▫️▫️▫️▫️▫️▫️
◽️▫️▫️▫️▫️▫️▫️▫️▫️
◽️▫️▫️▫️▫️▫️▫️▫️▫️
◽️▫️▫️▫️▫️▫️▫️▫️▫️
◽️▫️▫️▫️▫️▫️▫️▫️▫️
◽️▫️▫️▫️▫️▫️▫️▫️▫️
◽️▫️▫️▫️▫️▫️▫️▫️▫️
◽️◽️◽️◽️◽️◽️◽️◽️◽
""",
        """
▫️▫️▫️▫️▫️▫️▫️▫️▫️
▫️▫️▫️▫️▫️▫️▫️▫️▫️
▫️▫️▫️▫️▫️▫️▫️▫️▫️
▫️▫️▫️▫️▫️▫️▫️▫️▫️
▫️▫️▫️▫️▫️▫️▫️▫️▫️
▫️▫️▫️▫️▫️▫️▫️▫️▫️
▫️▫️▫️▫️▫️▫️▫️▫️▫️
▫️▫️▫️▫️▫️▫️▫️▫️▫️
▫️▫️▫️▫️▫️▫️▫️▫️▫️
""",

"اتماممممممم"]
Heart = [
    "❤️🧡💛💚",
    "💜💙🖤💛",
    "🤍🤎💛💜",
    "💚❤️🖤🧡",
    "💜💚🧡🖤",
    "🤍🧡🤎💜",
    "💙🧡💜🧡",
    "💚💛💙💜",
    "🖤💛💙🤍",
    "🤍💙❤🖤",
    "تمام"
]

command="""
______programmer_______order_info\n
/start\n
______\n
/help\n
______\n
تاریخ\n
______\n
ربات\n
_____
بات\n
_____
ایران\n
______
سازنده\n
_______\n
"""
async def GPT(text,message):
    ans = requests.get(
        "https://api2.haji-api.ir/gpt/gpt.php?text={}".format(text)).json()["result"]["answer"]
    await message.reply("پاسخ شما:\n{}".format(ans))


    # models.is_group       
          
async def main():
    
    async with Client(session='MyBot_gbt') as client:
        @client.on(handlers.MessageUpdates())
        async def updates(message: Message):
            
               
            guid = message.object_guid
            text = message.raw_text
            

            
            if message.raw_text != None and message.raw_text == '/start':
                
                await message.reply("ربات فعال شدبرای لیست دستورات /help رابنویسید")
                
            if  message.raw_text != None and message.raw_text == '/help':
#                 await message.reply("""
# ______programmer_______order_info\n
# /start\n
# ______\n
# /help\n
# ______\n
# تاریخ\n
# ______\n
# ربات\n
# _____
# بات\n
# _____
# ایران\n
# ______
# سازنده\n
# _______\n
# فلسطین\n
# _______\n
# بیو\n
# _____\n
# امامان\n
# ______\n
# قلب""")
                await message.reply('لیست دستورات به شرح زیر است :\n'
                                    "/start\n"
                                    "/help\n"
                                    "تاریخ\n"
                                    "ربات\n"
                                    "بات\n"
                                    "ایران\n"
                                    "سازنده\n"
                                    "فلسطین\n"
                                    "بیو\n"
                                    "امامان\n"
                                    "قلب\n"
                                    "سلام\n"
                                    "خوبی\n"
                                    "چه خبر\n"
                                    "برعنداز\n"
                                    "بسیجی\n"
                                    "وطن\n"
                                    "عشق\n"
                                    "ناشناس\n"
                                   "مشهد\n"
                                   "پایتخت\n"
                                   "تاس\n"
                                   "فحش\n"
                                   "اسلام\n"
                                   "شماره\n"
                                   "شیعه\n"
                                   "ابرقدرت\n"
                                   "امام زمان\n"
                                   "جوک\n"
                                   "😭\n"
                                   "کنکور\n"
                                   "دربی\n"
                                   "انگیزشی\n"
                                   "گردان سایبری\n"
                                   "گونی\n"
                                   "تمام\n"
                                   "ساکت\n"
                                   "ربات تلگرام\n"
                                   "معرفی\n"
                                   "خاموش\n"
                                   "بات جونم\n"
                                   "شروع\n"
                                   "خر\n"
                                   "افرین\n"
                                   "🇮🇷\n"
                                   "🇵🇸\n"
                                   "نماز\n"
                                   "وطن\n"
                                   "ساعت \n"
                                   "سایت داری\n"
                                   "دنس\n"
                                   "اخطار\n"
                                   "ایموجی\n"
                                   "شمارش\n"
                                   "دورود\n"
                                   "برای به دست اوردن اطلاعات شماره های ایرانی کد کشور رابزنید وبعد شماره بنویسید\n"
                                   "با چه زبانی نوشته شدی\n"
                                   "برای برعکس کردن نوشته شما این نوشته را قبل از متن خود بنویسید:!\n"
                                   "توجه این دستور فقط روی زبان انگلیسی کارمیکنه برای بزرگ کردن نوشته کوچک این را بنویسید کنارش :%\n"
                                   "این دستور برای زبان انگلیسی است اگر میخواید نوشته بزرگ انگلیسی شما کوچک شود قبل نوشته این دستور را بدید :#\n"
                                   "برای ترجمه نوشته فارسی به انگلیسی این علامت را قبل نوشتن بزنید  +\n"
                                   "برای ترجمه انگلیسی به فارسی از این نوشته قبل از متن وارد کنید:-\n"
                                   
                                   "برای کار کردن با بخش هوش مصنوعی  از این علامت استفاده کنید : *\n")
                
                
                
                
                
                
                
                

                
                
                
                
                
                
                
            if message.raw_text != None and message.raw_text == 'تاریخ':
       
                
                 
                await message.reply(f"🕛       {t}       🕛")
                
            
            if message.raw_text !=None and message.raw_text =="ربات":
                b=random.randint(1,8)
                if b ==1:
                    await message.reply("جان ربات شما دستور بده🇮🇷") 
                
                if b ==2:
                    await message.reply("بله بفرمایید")   
                
                if b ==3:
                    await message.reply("باز چی چیکارم داری؟")  
                
                if b ==4:
                    await message.reply("ها  چی از من مظلوم میخوای")  
                
                
                if b ==5:
                    await message.reply("سلام چی میخوای")   
                
                if b==6:
                    await message.reply("بنال منتظرم")    
                
                if b==7:
                    await message.reply("سلام عشقم چی میخوای؟")
                    
                    
                if b==8:
                    await message.reply("چه میخوای دلقک؟")
                
                if b ==9:
                    await message.reply("جی میخوای بچه ؟")
                    
                        
                         
                        
                           
                 
            
            if  message.raw_text !=None and message.raw_text =="بات":
                p=random.randint(1,5)
                if p ==1:
                    await message.reply("بله فرمانده درخدمت شما هستم ") 
                
                if p ==2:
                    await message.reply("زر بزن ببینم؟")     
                
                if p== 3:
                    await message.reply("بله شما فقط دستور بده")  
                
                if p ==4:
                    await message.reply("بله کاربر عزیزدستور بده") 
                
                if p ==5:
                     
                    await message.reply("خسته ام کردی اهه چقدر زر میزنی")   
                         
                 
                    
                
            if message.raw_text !=None and message.raw_text =="ایران":
                
                await message.reply("پاینده باد جمهوری اسلامی ایران🇮🇷")
               
            if message.raw_text !=None and message.raw_text =="سازنده":
                await message.reply("بفرماید اینم از سازنده من : @Sepah_cyber1383")  
                  
            if message.raw_text !=None and message.raw_text =="فلسطین":
                await message.reply("کشوری در اسیا وخاورمیانه که درگیرجنگ بارژیم صهیونیست اشغالگر  است .")
            
            
            if  message.raw_text !=None and message.raw_text =="بیو":
                bio=random.randint(1,21)
                
                if bio ==1:
                    await message.reply("خدای من...🤍 تمام‍ زندگی ام را خودت نقاشی کن🫵🏻❤️‍🩹 من به قل‍م‍ طُ ایمان دارم‍ :)🖌️️")
                if bio==2:
                    await message.reply("🌸 الّلهُــــــمَّ عَجِّــــــلْ لِوَلِیِّکَــــــ الْفَـــــــــرَج🌸")
                if bio==3:
                    await message.reply("ازادی قدس")
                
                if bio ==4:
                    await message.reply("حقیقت را در یک جا میتوان یافت :کد!") 
                
                if bio ==5:
                    await message.reply("﷽حَسْبُنَاالله‌وَنِعْمَ‌الْوَکیٖلْ...خُڋا‌ݕَڔٰاےِݦَݧ‌ْڬٰاڣٖیښٺ❤")
                            
                if bio ==6:
                    await message.reply("«بِسّـم‌رَب‌ِح‌ُـسین‌والمهدی(عج)»")
                            
                if bio ==7:
                    await message.reply("'نسل‌ما‌نسل‌ظهور‌است،اگربرخیزیم..!️")
                
                if bio ==8:
                    await message.reply(" ··• خدایا رسیدن به آنچه آرزومندیم را برای ما آسان کن🦋🌎.")
                
                if bio ==9:
                    await message.reply("شدی حلقه تکرار من!")
                
                if bio ==10:
                    await message.reply("میگفت:بسیجی‌خامنه‌ای‌بودن‌از‌سرباز‌خمینی‌بودن‌سخت‌ تره'✋🏾!")
                if bio ==11:
                    await message.reply("'ای که میدانی ندارم غیر درگاهت پناهی 🌱💚️ ")
                
                if bio ==12:
                    await message.reply("چقَدر زیبایَنِد آنان کهِ از ریشِه خوبَند🤍💯️")
                
                if bio ==13:
                    await message.reply("قوی بمون ، هنوز آخر قصه نرسیده !🌝💫️ ")
                
                
                if bio ==14:
                    await message.reply("آگاه باشید، تنها با یاد خدا دل ها آرام مى گیرد...💙️")
                
                if bio ==15:
                    await message.reply("'خواهرم به حق خانم فاطمه ی زهرا (س) حجابت رو حفظ کن")
                
                if bio ==16:
                    await message.reply("'تاخون در رگ ماست سید علی رهبر ماست✋🏾")       
                
                if bio ==17:
                    await message.reply('حِسبِی الله👑♥️🤍️  ✯\n'
                         'خدایی که به شدت کافیست♥') 
                
                if bio ==18:
                    await message.reply("هـرکسے\n "
                         " یڪ‌‌ دِلبـر جانانہ‌ دارد\n"
                         "من #ط را♥\n"
                         "مهدی جـان\n"
                         "اللّهمَّ‌عَجِّلْ‌لِوَلِیِّڪَ‌الفَرَج💚️ ")
                
                if bio ==19:
                    await message.reply("loding..")
                
                if bio ==20:
                    await message.reply("آن چه دعا انجام می دهد بیش از\n"
                                        "خیال و تصوّر این دنیاست..")  
                
                if bio ==21:
                    await message.reply("تا خدا بنده نواز است ب خلقش چ نیاز است")          
                
                if bio ==19:
                    await message.reply("سخت‌است‌‌عاشق شوی‌ویارنخواهد! دلتنگ‌'حرم'باشے و'ارباب'نخواهد!(:️️ ")
                
                if bio ==20:
                    await message.reply("در #غزه پس از بمباران یک خانه تنها  یک آیه ای از قران باقی مانده است\n"
                         'جُندَنَا لَهُمُ ٱلۡغَٰلِبُونَ.\n'
                        '《و سپاه ما بر كافران پيروزند️》\n' 
                        " #طوفان_الاقصی")
                
                if bio == 21:
                    await message.reply("برای ظهور اقا امام زمان صلوات")  
                                        
                    
            if  message.raw_text !=None and message.raw_text =="امامان":
                await message.reply("لیست امامان به ترتیب :\n"
                     "امام علی  (ع)\n"
                     "امام حسن (ع)\n"
                     "امام حسین (ع)\n"
                     "امام سجاد (ع)\n"
                     "امام باقر(ع)\n"
                     "امام جعفر صادق (ع)\n"
                     "امام موسی کاظم(ع)\n"
                     "امام رضا (ع)\n"
                     "اامام محمد تقی (ع)\n"
                     "امام علی نقی(ع)\n"
                     "امام حسن عسگری (ع)\n"
                     "امام زمان عج ویاهمان امام مهدی که غایب است ویک روزی میاید ودنیا را پر از اعدالت میکند \n"
                     "🌸 الّلهُــــــمَّ عَجِّــــــلْ لِوَلِیِّکَــــــ الْفَـــــــــرَج🌸")
                
          
            
            if message.raw_text !=None and message.raw_text =="سلام":
                
                await message.reply("علیک سلام ")
                
            if message.raw_text !=None and message.raw_text =="خوبی":
                await message.reply("شکر خوبم به خوبیت")

            
            if message.raw_text !=None and message.raw_text =="چه خبر":
                await message.reply("سلامتی رهبر")
                
            if message.raw_text !=None and message.raw_text =="قدس":
                await message.reply("بیت المقدس یکی از مکان های مهم در جهان که برای ازادی آن بادشمن میجنگن ودشمن آنها یهودیان هستند .\n"
                         "🇮🇷🇵🇸🇮🇷🇵🇸🇮🇷🇵🇸")
            
            if message.raw_text !=None and message.raw_text=="برعنداز":
                await message.reply("برعنداز موجودی کاملا بی عقل که سعی در اسیب زدن به جمهوری اسلامی ایران را دارد\n"
                         "ولی نمیداند این نظام تاظهور اقاامام زمان پابرجامیماند چون خداوند مراقب جمهوری اسلامی است \n"
                         "🤲🏻🌱•|اَللّٰهُمَّ عَجِّل لِوَلیِّکَ الفَرَجــے|•🌱🤲🏻️ ")
            
            if message.raw_text !=None and message.raw_text=="بسیجی":
                await message.reply("سازنده بسیج که نیروی مردمی است را امام خمینی تاسیس کرد وتاکنون  هم بوده وزیر نظر سپاه پاسداران انقلاب  اسلامی است \n"
                         "به فرموده امام خمینی بسیج نیروی مخلص خداست.")
            
            if message.raw_text !=None and message.raw_text=="ناشناس":
                await message.reply('https://harfeto.timefriend.net/16982326707474'
                     "لینک پیام ناشناس اگر سوالی ویا نظر داشتید بگید") 
            
            if message.raw_text !=None and message.raw_text=="عشق":
                await message.reply("'عشق یعنی علاقه داشتن به فرد یا هرچیزی که قابلیت دوست داشتن و حس داشتن داشته باشد \n'"
                     "تنها عشقی که برای همیشه ودر کنارت است خدا است و در اخرت هم کمک میکند")
            
            
            if message.raw_text !=None and message.raw_text=="مشهد":
                await message.reply("'شهر مقدس مشهد که در کشور ایران ودر خراسان رضوی قرار دارد که دز آنجا ارامگاه امام رضا است ")
                
            if message.raw_text !=None and message.raw_text=="پایتخت":
                await message.reply("شهر های مهم کشورهارا پایتخت میگویند که از لحاظ امنیت ومنابع کامل تر است پایتخت ایران تهران است .")
            
            if  message.raw_text !=None and message.raw_text=="تاس":
                tas=random.randint(1,6)
                if (tas ==1):
                    await message.reply("[0]")  
                
                if (tas ==2):
                    await message.reply("[00]") 
                    
                
                if (tas ==3):
                    
                    
                    await message.reply("[000]")  
                
                if (tas ==4):
                    
                    
                    await message.reply("[0000]")  
                if (tas ==5):
                    await message.reply("[00000]")
                
                if (tas ==6):
                    
                    await message.reply("[00000]")
            if message.raw_text !=None and message.raw_text=="فحش":
                await message.reply("فحش یک حرف یاسخن زشت وناپسند است که طرف مقابل برای بی احترامی میگوید")
                        
            if message.raw_text !=None and message.raw_text=="اسلام":
                await message.reply('دین مقدس وپاک اسلام گه اخرین دینی است که خداوند برتمامی انسان ها فرستاد وحضرت محمد را مسِئول  هدایت  مردم کرد که به دین اسلام ومسلمان شدن  روی اورند کتابی  که اسلام وحضرت محمد اوردند قرآن کبیر واسمانی  بود \n'
                         "«ٱللَّٰهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ»\n"
                         "قرآن کریم که از طرف خداوند است وتابحال کسی اورا تحریف نکرده ")
                
            if  message.raw_text !=None and message.raw_text=="شماره":
                
                
                
                ir = "0933{}".format(random.randrange(1111111, 9999999))
                mci="0915{}".format(random.randrange(1111111, 9999999))
                rithl="0922{}".format(random.randrange(1111111, 9999999))
                await message.reply(ir+":"+"ایرانسل")
                await message.reply(mci+":"+"همراه اول")
                await message.reply(rithl+':'+'رایتل')
                
                
            if  message.raw_text !=None and message.raw_text=="وطن":
                await message.reply('🇮🇷🇮🇷جای که در آنجا متولد شدیم وآنجا زندگی میکنیم وطن ماایران است \n')
            
            if  message.raw_text !=None and message.raw_text=="شیعه":
                await message.reply("شیعه دوازده‌امامی ( اثنىٰ‌عشری) یکی از مذاهب امامیه است که به امامت ۱۲ امام پس از پیامبر اسلام، باور\n"
                     "دارند. شیعه دوازده امامی حدود ۸۵ درصد تقریباً ۱۵۰ میلیون نفر[۱] از شیعیان را تشکیل می‌دهد.[۲] آنها معتقدند\n"
                     "آخرین امام، حجت بن الحسن، در غیبت زندگی می‌کند و به عنوان مهدی موعود ظهور خواهد کرد و دوره حکومت\n"
                     "مهدی مصادف با ظهور دوم عیسی خواهد بود و باهم دجال را نابود میکنند .\n"
                     ) 
                
            if message.raw_text !=None and message.raw_text=="امام زمان": 
                await message.reply('امام زمان یا همان امام مهدی عج هستن که طبق گفته مسلمانان وجهانیان یک روزی ظهور میکند و دنیا را از ظلم نجات میدهد \n'
                     "وکل دنیا را عدل وعدالت برقرار میکند ودین اسلام برهمه دنیا قالب میشود \n"
                     "🤲🏻🌱•|اَللّٰهُمَّ عَجِّل لِوَلیِّکَ الفَرَجــے|•🌱🤲🏻️ ")  
            
            if message.raw_text !=None and message.raw_text=="ابرقدرت": 
                await message.reply("☫🇮🇷ابرقدرت جهان حمهوری اسلامی ایران ☫🇮🇷")   
                  
            
            if message.raw_text !=None and message.raw_text=="جوک": 
                j=joke.get_joke()
                
                jok=random.randint(1,13)
                if jok ==1:
                    await message.reply("آیا می دانید زبان فارسی مختصرترین زبان دنیاست؟\n"
                                        "مثال :\n"
                                        "یک کلمه است : اومدیا")
                
                if jok ==2:
                    await message.reply(j) 
                
                if jok ==3:
                    await message.reply("چه بوی کبابی میاد…\n"
                                        "نه همون بالا بود اینجا نمیاد")       
                
                if jok ==4:
                    await message.reply("زنه زنگ زده رادیو میگه :\n"
                                        "۵۰ساله با شوهرم ازدواج کردم خیلی بدبینه چیکار کنم؟😳😐\n"
                                        "مشاور:\n"
                                        "یکم دیگه تحمل کن…\n"
                                        "بلاخره یکیتون میمیرید 😐😂")
                
                if jok ==5:
                    await message.reply("یه چند وقتیه کودک درونم ناآرومه، مدام بهانه می گیره و … به نظرتون اگه بزنم لهش کنم، کودک آزاری محسوب می شه؟")
                
                
                if jok ==6:
                    await message.reply(" روزامون برعکس شده، صبح خسته از خواب بلند می شیم، شبا پر از انرژی می خوابیم.")
                
                
                if jok ==7:
                    await message.reply("مشهدیا یه واحد پولی داریم به اسم\n"
                                        "دم حرم همینو میدن انقدر")
                
                if jok ==8:
                    await message.reply(" درسته پراید کولرش خوب نیست ولی وُژدانی بخاریش خوب خنک می کنه!")
                
                if jok ==9:
                    await message.reply("طرف ميره پيش امام جماعت مسجدشون ميگه ببخشيد با کفش هم ميشه نماز خوند ؟ پيش نماز ميگه نه نميشه ! طرف ميگه پس من خوندم شد!!!!")           
                
                if jok ==10:
                    await message.reply("استیو جابز میگه اگه بى هدف از خواب بیدار شدید، برگردید برید بخوابید?\n"
                                        "آخه آدم انقدر فهمیده؟ ??")
                
                if jok ==11:
                    await message.reply("یکی رفت بالا دیگه نتونست بیاد پایین")
                
                if jok ==12:
                    await message.reply("شاهزاده رضاپهلوی پادشاه ایران شد")  
                
                if jok ==13:
                    await message.reply("میگن : اسمت چیه ؟\n"
                                      "میگه :\n"
                                      "SUN OF GOD BETWEEN TWO WATER OF ORIGINAL\n"
                                      "میگه : شمس الله میاندوآبی اصل\n")    
                    
                         
                     
                    
                                    
            if message.raw_text !=None and message.raw_text=="😭":
                await message.reply("وای گریه نکنید گریه چیزی را درست نمیکنه امید داشته باشید ")
            if  message.raw_text !=None and message.raw_text=="کنکور":
                await message.reply("کنکور یک ازمون است که جمع کل درس های دبیرستان شامل اش میشوند وبرای ورود به دانشگاه باید از آن گذشت وقبول شد \n")
            if message.raw_text !=None and message.raw_text=="دربی":
                await message.reply("به  دیدار دوتیم باشگاهی یزرگ مثل پرسپولیس واستقلال که هم شهری هستن را دربی میگویند    ")
            
            if message.raw_text !=None and message.raw_text=="انگیزشی":  
                a=random.randint(1,12)
                if a==1:
                     await message.reply("دانش آموزان عزیز اگر \n"
                     "درس نخوانید به خون \n"
                     "شهدا خیانت کرده اید\n"
                     'بکوشید ودرس بخونید\n'
                     "وباتهد به انقلاب حافظ ارمان ها ودتاورد های \n"
                     "خون شهدا باشید\n"
                     "وصیت نامه شهید محمد رمضانی\n"
                     "🇮🇷❤️ \n"
                     "#انگیرشی") 
                
                if a==2:
                    await message.reply("این جمله انگیزشی برای بسیاری از مردم قابل ارائه است، زیرا به آن‌ها یادآوری می‌کند که برای رسیدن به هدف‌هایشان، باید شجاع و امیدوار باشند\n"
                                        "و هرگز نباید از پای دراز کنند") 
                
                if a==3:
                    await message.reply("اگر جاده ای پیدا کردید که هیچ مانعی در آن نبود\n"
                                        "به احتمال زیاد آن جاده به جایی نمی رسد")
                
                if a==4:
                    await message.reply("اگر می‌خواهید خواب‌ هایتان تعبیر شوند، اول باید بیدار شوید. “ج. م. پاور”")
                
                if a==5:
                    await message.reply("هیچ وقت برای چیزهایی که می تونی خودت به دست بیاری به کسی التماس نکن!\n")
                
                if a==6:
                    await message.reply("موفقیت این نیست که هرگز اشتباه نکنیم\n"
                                        "بلکه یعنی یک اشتباه را دوباره تکرار نکنیم\n"
                                        )        
                             
                if a==7:
                    await message.reply("بزرگترین لذت در زندگی انجام کاری است که دیگران می گویند: تو نمی توانی! “رومن پولانسکی”")
                
                if a==8:
                    await message.reply("برای رسیدن به روزهای خوب باید چند روزی را بد گذراند\n")
                
                
                if a==9:
                    await message.reply("با رویاهات بخواب و با اهدافت از خواب بیدار شو.")
                if a==10:
                    await message.reply("بازی تموم نمی شه تا وقتی برنده بشم!")
                
                if a==11:
                    await message.reply("شما به خاطر این که پولی ندارید فقیر نیستید\n"
                                        "بلکه اگر آرزویی نداشته باشید فقیر هستید")
                
                if a==12:
                    await message.reply("هیچ وقت نگو نمیتونم همیشه بگو میتونم")
                
                          
                       
                                
                                 
                        
            
               
            if  message.raw_text !=None and message.raw_text=="گردان سایبری":  
                await message.reply("گردان سایبری برای عملیات های فیلترینگ و هک علیه دشمنان در فضایی مجازی انجام میشه برای  پاک کردن آنها \n"
                     "گردان سایبری ما در روبیکا را دنبال کنید :\n"
                     "https://rubika.ir/joing/EHEGCCGG0RUZPNTTJKUOFRGNLBJSXLMS\n"
                     "#گردان_لبیک_یازینب")
            
            
            if message.raw_text !=None and message.raw_text=="گونی":
                await message.reply("گونی مکانی برای تجمع دشمنان جمهوری اسلامی است که برای نابودی این نظام تلاش میکنند ولی اخرش دستگیر و به گونی میروند")
                  
            
            if message.raw_text !=None and message.raw_text=="سیگما":
                await message.reply('خب سیگما به کسی میگویند که هیچ علاقه ای به جنس مخالف ندارد وروی پای خودش است ولی میگویند که زنان در جامعه اهمیت میدهند 🙅‍♂️🏋️👤')
            
            
            if message.raw_text !=None and message.raw_text=="تمام":
                await message.reply("باشه پس غیرفعال میشم!")
            
            if  message.raw_text !=None and message.raw_text=="ساکت ":
                await message.reply("باشه ساکت میشم ")  
            
            if  message.raw_text !=None and message.raw_text=="ربات تلگرام": 
                await message.reply("@chatbotbot84bot\n"
                                    "ربات تلگرامی ما")
            
            
            if message.raw_text !=None and message.raw_text=="معرفی":
                await message.reply("Name:A01\n"
                                    "City:Mashhad\n"
                                    "Country:Iran\n"
                                    "programmer:  @Sepah_cyber1383")
                
            
            if  message.raw_text !=None and message.raw_text=="بات جونم": 
                await message.reply("جان ربات ")
            
            if  message.raw_text !=None and message.raw_text=="خاموش": 
                await message.reply("هی ربات خاموش شد ")  
            
            if  message.raw_text !=None and message.raw_text=="شروع":
                await message.reply("اماده فرمان هستم ")
            
            if message.raw_text !=None and message.raw_text=="خر": 
                await message.reply("بی ادب  خر خودتی حرف زشت نزن!!")
            
            
            if message.raw_text !=None and message.raw_text=="افرین":   
                await message.reply("از کلمه افرین خوشم نمیاد")
            
            if  message.raw_text !=None and message.raw_text=="🇮🇷":  
                await message.reply("جانم به فدای این پرچم جمهوری اسلامی ایران 🇮🇷🇮🇷🇮🇷🇮🇷🇮🇷")   
                
                
            
            
       
                 
            
            if message.raw_text !=None and message.raw_text=="🇵🇸"  :
                await message.reply("به امید ازادی فلسطین 🇵🇸🇵🇮🇷") 
                
            
            if message.raw_text !=None and message.raw_text=="سیگما نشون بده"  :   
                await message.reply("بفرما سیگما: @UnknownSoldieSigma_1_2_3") 
                
                
            if  message.raw_text !=None and message.raw_text=="نماز"  :  
                await message.reply('نماز یک نوع عبادت وسخن گفتن باخداست که به زبان عربی گفته میشه وتمامی مسلمانان باید این امر واجب را انجام بدهند ')
            
            
            if message.raw_text != None and message.raw_text =="وطن":
                await message.reply('جای که در آنجا متولد شدیم وآنجا زندگی میکنیم وطن ماایران است \n')
            
            
            if   message.raw_text != None and message.raw_text =="ساعت": 
                now=datetime.datetime.now()
                current_time = now.strftime("%H:%M:%S")
                await message.reply(current_time)
                
            
            if   message.raw_text != None and message.raw_text =="سایت داری":
                
                await message.reply("بله ولی هنوز روی هاست نرفته هروقت بره میتونید از سایت مادیدن کنید")  
            
            if message.raw_text != None and message.raw_text.startswith("*"):
                text = message.raw_text.replace("*", "")
                await message.reply("منتظر بمانید")
                try:
                    create_task(GPT(text,message))
                except Exception as e:
                    await message.reply("پاسخی یافت نشد")
            
            elif text == "دنس":
                
                ss = await message.reply('start')
                
                for ani in Dans:
                    
                    await client.edit_message(guid, ss['message_update']['message_id'], ani)
          
                        
            elif text == "قلب" or text == "Heart":
                
                ss = await message.reply('❤️ start ❤️')
                
                for hrt in Heart:
                    await client.edit_message(guid, ss['message_update']['message_id'], hrt)
            
                
            elif text == "اخطار" or text == "Danger":
                
                ss = await message.reply('❌start❌')
                for dn in Stikers:
                    
                    await client.edit_message(guid, ss['message_update']['message_id'], dn)    
            
            if message.raw_text != None and message.raw_text.startswith("https://"):
                await message.reply("اخطار لینک ممنوعه")
            
            if message.raw_text != None and message.raw_text.startswith("+"):
                g=GoogleTranslator("fa","en").translate(message.raw_text)
                await message.reply(g)
            
            if message.raw_text != None and message.raw_text.startswith("-"):
                  
                
                
                  
                g2=GoogleTranslator("en","fa").translate(message.raw_text)
                await message.reply(g2)
                
              
            if message.raw_text != None and message.raw_text.startswith("!"):   
                await message.reply(message.raw_text[::-1])
            
            if message.raw_text != None and message.raw_text.startswith("#"):
                string_1= message.raw_text
                string_2= string_1.lower()
                await message.reply(string_2)
            if message.raw_text != None and message.raw_text.startswith("%"):
                string_2= message.raw_text
                string_3= string_2.upper()
                await message.reply(string_3)
                
            
            if message.raw_text !=None and message.raw_text =="باچه زبانی نوشته شدی":
                await message.reply("بازبان برنامه نویسی پایتون کد نویسی شده")
            
            
            elif text =="شمارش":
                s=await message.reply("0")
                for num in  nmber_list:
                    await client.edit_message(guid, s['message_update']['message_id'],num)
            
            elif text =="دورود":
                s=await message.reply("سلام")
                for dorod in list_salam:
                    await client.edit_message(guid, s['message_update']['message_id'],dorod)
            
            elif text =="ایموجی" :
                s=await message.reply("ایموجی")    
                for eimoji in list_eimoji :
                    
                    await client.edit_message(guid, s['message_update']['message_id'],eimoji)
            
            
            if message.raw_text != None and message.raw_text =="فحش بد":
                await client.block_user(guid)
            
            
            if message.raw_text  != None and message.raw_text =="کیر":
                await client.block_user(guid)
            
            
            if message.raw_text!=None and message.raw_text =="الاغ":
                       await client.block_user(guid)
            
            
            if message.raw_text!=None and message.raw_text =="اسکل":
                await client.block_user(guid)
            
            
            if message.raw_text!=None and message.raw_text =="گوه نخور":
                
                await client.block_user(guid)
            
            
            if message.raw_text!=None and message.raw_text =="کونی":
                await client.block_user(guid)
            
            
            if  message.raw_text!=None and message.raw_text =="بلاک":
                 await client.block_user(guid)
            
            
            if message.raw_text!=None and message.raw_text =="fack":
                   await client.block_user(guid)
            
            
            if message.raw_text!=None and message.raw_text =="فاک":
                       await client.block_user(guid)
            
            
            if message.raw_text != None and message.raw_text.startswith("رل"):
                await client.block_user(guid)
                
            
                
            
            elif text =="رهبر":
                with open('iran.png',"rb")as p:
                    pp=p.read()
                    try:
                        
                        
                        await client.send_photo(object_guid=guid,photo=pp,reply_to_message_id=['message_id'])
                            
                    except :
                        await message.reply("منتظربمانید")
                        
            
            if  message.raw_text != None and message.raw_text.startswith("+98"):
                number =parse(message.raw_text)
                num=is_valid_number(number)
                
                
                
                await message.reply(f"اطلاعات شماره موبایل:\n  کشور:{geocoder.description_for_number(number,'en')}\n سیمکارت:{carrier.name_for_number(number,'en')}\n ")
            
            
            
            if message.raw_text != None and message.raw_text.startswith("++"):
                list_command.append(message.raw_text)
                with open("order.txt", "w") as o:
                    
                    o.write(str(list_command))
                
                
                with open("order.txt", "r") as o:
                    
                    file_content = o.readline()
                    print(file_content)
            
            
            if message.raw_text != None and message.raw_text=="اسکرین شات بگیر":  
                s =pyautogui.screenshot("s.png")
                
            
            
            if message.raw_text != None and message.raw_text=="سایت گوگل را باز کن" :
                webbrowser.open("google.com")
                
                
       
            
            
                 
                
                
                
                
                
                      
                    
                    
                    
            
                    
                    
                        
   
                    
                    
                    
                        
                
                
                
            
                
                            
                            
                            
                            
                            
                            
                    
                    
                    
                    
                    
            
                
               
                
                 
            
            
            
                
            
            
            
            
            
            
            
                  
                
                
                
                
                
                
                
                
                           
                        
                        
            
            
            
                        
                        
            
                
            
            
            
                
                       
                      
                
                           
            
            
                
                
                
                
            
            
        
                
                
                    
                        
                
                
            
            
             
                
                
                
                       
            
            
            
                
                
                
                
                
                            
                    
                    
                        
                    
                    
                    
                
            
                
                
                
                
            
                
                
            
            
                
                    # 🦁🐵🐒🦍🦧🐶🦮🐕‍🦺🐈🐴🐆🐅🐯🐩🦇🦜🦅🐻🤵👸🤵‍♀️👰👰‍♂️👸🤴🫅👷‍♂️👷‍♂️👳‍♂️👩‍👧‍👧👩‍👧‍👦👩‍👧👩‍👦‍👦👩‍👩‍👦‍👦👩‍👩‍👧‍👧👨‍👦👨‍👦‍👦👨‍👧👨‍👧‍👦👨‍👧‍👧🫂👨‍❤️‍👨👩‍❤️‍👩💏👩‍❤️‍💋‍👨👨‍❤️‍💋‍👨👩‍❤️‍💋‍👩💑👩‍❤️‍👨🧑‍🤝‍🧑
            
            
                
            
            
             
                
            
                
                
                
            
# string_1= "AMIRHOSIN.com"
# string_2= string_1.lower()
# print(string_2)
        
                   
                
        #     birthday = datetime.datetime.strptime(dateofbirth, "%d/%m/%Y")
        # now=datetime.datetime.now()

        # age=now.year -birthday.year -((now.month,now.day)<(birthday.month,birthday.day))    
            
          
                
                
                
                
                 
                
                
                  
        #     def Reversetheletters(TEXT):
        # print(TEXT[::-1])    
            
            
            
            
                
              
            
            
           
                
                
                
                
                 
                
                
                
            

         

            
                    
                    
           
                
            

                #    https://rubika.ir/joing/EIFAGHHE0ITVSZNIEMQUWAJPGPRPBFYD
            
   
  
                    
        await client.run_until_disconnected()

asyncio.run(main())



# اموزش هک
# https://learnfiles.com/course/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%AA%D8%B3%D8%AA-%D9%86%D9%81%D9%88%D8%B0-%D8%A8%D8%A7-%D9%BE%D8%A7%DB%8C%D8%AA%D9%88%D9%86/
# https://learnfiles.com/cart/